<?php include_once "./api/base.php" ?>
<?php
// 非管理者導回首頁
if(!isset($_SESSION["admin"])){
  to("./index.php");
  exit();
}
?>
<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>後台管理中心</title>
    <link rel="stylesheet" href="./css/basic.css">
    <link rel="stylesheet" href="./css/back.css">
</head>

<body>
    <!--------------------------------------------------- 上方開始 --------------------------------------------------->
    <div id="header">
        <?php include "./layout/header.php";
        include "./layout/back_nav.php";
        ?>
    </div>
    <!--------------------------------------------------- 上方結束 --------------------------------------------------->

    <!--------------------------------------------------- 中間開始 --------------------------------------------------->
    <div id="main">
        <!--------------------------------------------------- 中間-左側廣告開始 --------------------------------------->
        <div id="section">
            <?php include "./layout/section.php"; ?>
        </div>
        <!--------------------------------------------------- 中間-左側廣告結束 --------------------------------------->
        <!--------------------------------------------------- 中間-投票內容開始 --------------------------------------->
        <div id="container">

            <?php
            if (isset($_GET['do'])) { //判斷do後面有沒有帶參數
                $file = "./back/" . $_GET['do'] . ".php"; //如果'do'有帶參數 => 就幫我串成"./back/do參數.php"的檔案
            }
            if (isset($file) && file_exists($file)) { //載入檔案前 => 先判斷有沒有 $file 且 $file 這個檔案存不存在
                include $file; //如果有 $file 且檔案存在,就幫我載入
            } else {
                include "./back/vote_list.php"; //如果'do'沒有帶參數或$file檔案不存在 => 就載入原本的投票列表
            }
            ?>

        </div>
        <!--------------------------------------------------- 中間-投票內容結束 --------------------------------------->
        <!--------------------------------------------------- 中間-右側廣告開始 --------------------------------------->
        <div id="aside">
            <?php include "./layout/aside.php"; ?>
        </div>
        <!--------------------------------------------------- 中間-右側廣告結束 --------------------------------------->
    </div>
    <!--------------------------------------------------- 中間結束 --------------------------------------------------->

    <!--------------------------------------------------- 下方開始 --------------------------------------------------->
    <div id="footer">
        <?php include "./layout/footer.php"; ?>
    </div>
    <!--------------------------------------------------- 下方結束 --------------------------------------------------->
</body>

</html>