<?php
include_once "./api/base.php";
?>
<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>線上投票系統</title>
    <link rel="stylesheet" href="./css/basic.css">
    <link rel="stylesheet" href="./css/font.css">
</head>

<body>
    <!--------------------------------------------------- 上方開始 --------------------------------------->
    <div id="header">
        <?php include "./layout/header.php";
        include "./layout/font_nav.php";
        ?>
    </div>
    <!--------------------------------------------------- 上方結束 --------------------------------------->

    <!--------------------------------------------------- 中間開始 --------------------------------------->
    <div id="main">
        <!--------------------------------------------------- 中間-左側廣告開始 --------------------------------------->
        <div id="section">
            <?php include "./layout/section.php"; ?>
        </div>
        <!--------------------------------------------------- 中間-左側廣告結束 --------------------------------------->
        <!--------------------------------------------------- 中間-投票內容開始 --------------------------------------->
        <div id="container">
            <?php
            if (isset($_GET['do'])) {
                $file = "./font/" . $_GET['do'] . ".php";
            }
            if (isset($file) && file_exists($file)) {
                include $file;
            } else {
                include "./font/vote_list.php";
            }
            ?>
        </div>
        <!--------------------------------------------------- 中間-投票內容結束 --------------------------------------->
        <!--------------------------------------------------- 中間-右側廣告開始 --------------------------------------->
        <div id="aside">
            <?php include "./layout/aside.php"; ?>
        </div>
        <!--------------------------------------------------- 中間-右側廣告結束 --------------------------------------->
    </div>
    <!--------------------------------------------------- 中間-結束 --------------------------------------->
    <!--------------------------------------------------- 下方-開始 --------------------------------------->
    <div id="footer">
        <?php include "./layout/footer.php"; ?>
    </div>
    <!--------------------------------------------------- 下方-結束 --------------------------------------->
</body>

</html>